{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "A": 5,
      "T": 6,
      "a": 7,
      "d": 8,
      "e": 9,
      "f": 10,
      "g": 11,
      "h": 12,
      "i": 13,
      "m": 14,
      "n": 15,
      "o": 16,
      "p": 17,
      "r": 18,
      "s": 19,
      "t": 20,
      "v": 21,
      "w": 22,
      "x": 23,
      "Ċ": 24,
      "č": 25,
      "Ġ": 26,
      "čĊ": 27,
      "is": 28,
      "re": 29,
      "Ġt": 30,
      "Th": 31,
      "Ġs": 32,
      "Ġis": 33,
      "ĠTh": 34,
      "en": 35,
      "ex": 36,
      "me": 37,
      "mo": 38,
      "ome": 39,
      "Ġa": 40,
      "Ġmo": 41,
      "Ġth": 42,
      "Ġtex": 43,
      "Ġsome": 44,
      "ĠThis": 45,
      "Ġmore": 46,
      "Ġtext": 47,
      "An": 48,
      "ar": 49,
      "ds": 50,
      "et": 51,
      "ev": 52,
      "ere": 53,
      "ear": 54,
      "in": 55,
      "no": 56,
      "of": 57,
      "or": 58,
      "pp": 59,
      "wor": 60,
      "ĠAn": 61,
      "Ġev": 62,
      "Ġno": 63,
      "Ġof": 64,
      "Ġwor": 65,
      "Ġset": 66,
      "ĠThen": 67,
      "Ġare": 68,
      "Ġapp": 69,
      "Ġthis": 70,
      "Ġthere": 71,
      "earin": 72,
      "ĠAnd": 73,
      "Ġeven": 74,
      "Ġnow": 75,
      "Ġwords": 76,
      "Ġappearin": 77,
      "Ġappearing": 78
    },
    "merges": [
      "č Ċ",
      "i s",
      "r e",
      "Ġ t",
      "T h",
      "Ġ s",
      "Ġ is",
      "Ġ Th",
      "e n",
      "e x",
      "m e",
      "m o",
      "o me",
      "Ġ a",
      "Ġ mo",
      "Ġt h",
      "Ġt ex",
      "Ġs ome",
      "ĠTh is",
      "Ġmo re",
      "Ġtex t",
      "A n",
      "a r",
      "d s",
      "e t",
      "e v",
      "e re",
      "e ar",
      "i n",
      "n o",
      "o f",
      "o r",
      "p p",
      "w or",
      "Ġ An",
      "Ġ ev",
      "Ġ no",
      "Ġ of",
      "Ġ wor",
      "Ġs et",
      "ĠTh en",
      "Ġa re",
      "Ġa pp",
      "Ġth is",
      "Ġth ere",
      "ear in",
      "ĠAn d",
      "Ġev en",
      "Ġno w",
      "Ġwor ds",
      "Ġapp earin",
      "Ġappearin g"
    ]
  }
}